----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  TableD10
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-Effort_Luck\STATA\Paper-Final\Logs/TableD10.log
  log type:  text
 opened on:   6 Jul 2021, 09:32:24

. use "Data/Exp2-cleaned-long.dta", clear

. 
. probit high_effort_hyp dg_gave_perc risk_invest_perc i.param if round==1, vce(cluster id)

Iteration 0:   log pseudolikelihood = -115.02501  
Iteration 1:   log pseudolikelihood = -103.52595  
Iteration 2:   log pseudolikelihood = -103.43927  
Iteration 3:   log pseudolikelihood = -103.43926  

Probit regression                               Number of obs     =        198
                                                Wald chi2(4)      =      19.01
                                                Prob > chi2       =     0.0008
Log pseudolikelihood = -103.43926               Pseudo R2         =     0.1007

                                       (Std. Err. adjusted for 198 clusters in id)
----------------------------------------------------------------------------------
                 |               Robust
 high_effort_hyp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    dg_gave_perc |    .023544   .0054499     4.32   0.000     .0128624    .0342257
risk_invest_perc |   .0027785   .0036579     0.76   0.447    -.0043909    .0099479
                 |
           param |
        300, 50  |   .1483842   .2517483     0.59   0.556    -.3450334    .6418018
         200, 0  |   .2355921   .2479524     0.95   0.342    -.2503857    .7215699
                 |
           _cons |  -1.712151   .3871705    -4.42   0.000    -2.470992   -.9533111
----------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        198
Model VCE    : Robust

Expression   : Pr(high_effort_hyp), predict()
dy/dx w.r.t. : dg_gave_perc risk_invest_perc 2.param 3.param

----------------------------------------------------------------------------------
                 |            Delta-method
                 |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    dg_gave_perc |   .0069725    .001373     5.08   0.000     .0042814    .0096636
risk_invest_perc |   .0008228   .0010809     0.76   0.446    -.0012956    .0029413
                 |
           param |
        300, 50  |   .0426599   .0723048     0.59   0.555    -.0990548    .1843746
         200, 0  |   .0693601    .072333     0.96   0.338      -.07241    .2111302
----------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. outreg2 using "Tables/TableD10", label alpha(0.01, 0.05, 0.10) ctitle("Dependent variable:", "=1 if member would have chosen e_H as DM", "Round 1 only") bdec(3) sdec(3) replace tex e
> xcel
Tables/TableD10.tex
Tables/TableD10.xml
dir : seeout

. 
. probit high_effort_hyp dg_gave_perc risk_invest_perc i.param i.round, vce(cluster id)

Iteration 0:   log pseudolikelihood = -313.38784  
Iteration 1:   log pseudolikelihood = -292.25984  
Iteration 2:   log pseudolikelihood =  -292.0857  
Iteration 3:   log pseudolikelihood = -292.08569  

Probit regression                               Number of obs     =        594
                                                Wald chi2(6)      =      23.96
                                                Prob > chi2       =     0.0005
Log pseudolikelihood = -292.08569               Pseudo R2         =     0.0680

                                       (Std. Err. adjusted for 198 clusters in id)
----------------------------------------------------------------------------------
                 |               Robust
 high_effort_hyp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    dg_gave_perc |   .0173148   .0039435     4.39   0.000     .0095857    .0250438
risk_invest_perc |   .0005972   .0027467     0.22   0.828    -.0047863    .0059806
                 |
           param |
        300, 50  |   .1205806   .1077183     1.12   0.263    -.0905433    .3317045
         200, 0  |   .0354193   .1269725     0.28   0.780    -.2134423    .2842809
                 |
           round |
              2  |  -.3493597    .121632    -2.87   0.004     -.587754   -.1109653
              3  |  -.1373508   .1210126    -1.14   0.256    -.3745311    .0998295
                 |
           _cons |  -1.270897   .2615595    -4.86   0.000    -1.783544   -.7582495
----------------------------------------------------------------------------------

. margins, dydx(*) post

Average marginal effects                        Number of obs     =        594
Model VCE    : Robust

Expression   : Pr(high_effort_hyp), predict()
dy/dx w.r.t. : dg_gave_perc risk_invest_perc 2.param 3.param 2.round 3.round

----------------------------------------------------------------------------------
                 |            Delta-method
                 |      dy/dx   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
    dg_gave_perc |   .0047927   .0009628     4.98   0.000     .0029057    .0066797
risk_invest_perc |   .0001653   .0007606     0.22   0.828    -.0013255    .0016561
                 |
           param |
        300, 50  |   .0335838   .0300224     1.12   0.263    -.0252591    .0924267
         200, 0  |   .0095683   .0342902     0.28   0.780    -.0576392    .0767758
                 |
           round |
              2  |  -.0960118   .0326114    -2.94   0.003     -.159929   -.0320946
              3  |  -.0406522   .0357087    -1.14   0.255    -.1106399    .0293355
----------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. outreg2 using "Tables/TableD10", label alpha(0.01, 0.05, 0.10) ctitle("Dependent variable:", "=1 if member would have chosen e_H as DM", "All rounds") bdec(3) sdec(3) append tex exce
> l
Tables/TableD10.tex
Tables/TableD10.xml
dir : seeout

. 
. capture log close _all
