----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  TableD3
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-Effort_Luck\STATA\Paper-Final\Logs/TableD3.log
  log type:  text
 opened on:   5 Jul 2021, 17:00:41

. use "Data/Exp1-cleaned-long-state.dta", clear

. keep if LGGame==1
(1,088 observations deleted)

. keep if b_Group3==1
(536 observations deleted)

. 
. * Pooled
. qui reg LogitPosterior LogitUnconditional LogitStateGood LogitStateBad, nocon vce(cluster ID)

. 
. lincom LogitUnconditional-1

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2669687   .0487277    -5.48   0.000    -.3630432   -.1708942
------------------------------------------------------------------------------

. local est1 = r(estimate)

. local tstat1 = r(estimate)/r(se)

. local pval1 = tprob(r(df), abs(`tstat1'))

. 
. lincom LogitStateGood-1

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2577939    .060399    -4.27   0.000    -.3768802   -.1387076
------------------------------------------------------------------------------

. local est2 = r(estimate)

. local tstat2 = r(estimate)/r(se)

. local pval2 = tprob(r(df), abs(`tstat2'))

. 
. lincom LogitStateBad-1

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0520412   .0756816    -0.69   0.492    -.2012596    .0971772
------------------------------------------------------------------------------

. local est3 = r(estimate)

. local tstat3 = r(estimate)/r(se)

. local pval3 = tprob(r(df), abs(`tstat3'))

. 
. lincom LogitStateGood-LogitStateBad

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2057527   .0815696    -2.52   0.012    -.3665803   -.0449251
------------------------------------------------------------------------------

. local est4 = r(estimate)

. local tstat4 = r(estimate)/r(se)

. local pval4 = tprob(r(df), abs(`tstat4'))

. 
. outreg2 using "Tables/TableD3", label ctitle("Dependent variable: Logit(posterior)", "Pooled") ///
>         adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) replace tex excel noas
Tables/TableD3.tex
Tables/TableD3.xml
dir : seeout

. 
. * Separate by treatments
. foreach x of varlist RA LA HA GA {
  2. qui reg LogitPosterior LogitUnconditional LogitStateGood LogitStateBad if `x'==1, nocon vce(cluster ID)
  3. 
. lincom LogitUnconditional-1
  4. local est1 = r(estimate)
  5. local tstat1 = r(estimate)/r(se)
  6. local pval1 = tprob(r(df), abs(`tstat1'))
  7. 
. lincom LogitStateGood-1
  8. local est2 = r(estimate)
  9. local tstat2 = r(estimate)/r(se)
 10. local pval2 = tprob(r(df), abs(`tstat2'))
 11. 
. lincom LogitStateBad-1
 12. local est3 = r(estimate)
 13. local tstat3 = r(estimate)/r(se)
 14. local pval3 = tprob(r(df), abs(`tstat3'))
 15. 
. lincom LogitStateGood-LogitStateBad
 16. local est4 = r(estimate)
 17. local tstat4 = r(estimate)/r(se)
 18. local pval4 = tprob(r(df), abs(`tstat4'))
 19. 
. outreg2 using "Tables/TableD3", label ctitle("Dependent variable: Logit(posterior)", "`x'") ///
>         adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) append tex excel noas
 20. 
. }

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2358623   .0713403    -3.31   0.001    -.3765211   -.0952035
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2556558   .0894925    -2.86   0.005    -.4321046   -.0792069
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0680457    .091748    -0.74   0.459    -.2489417    .1128504
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1876101   .1181109    -1.59   0.114    -.4204847    .0452645
------------------------------------------------------------------------------
Tables/TableD3.tex
Tables/TableD3.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2071268   .0572088    -3.62   0.000     -.319923   -.0943305
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2721021   .0784539    -3.47   0.001    -.4267866   -.1174176
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.062804   .1185663    -0.53   0.597    -.2965766    .1709685
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2092981   .1278245    -1.64   0.103    -.4613246    .0427284
------------------------------------------------------------------------------
Tables/TableD3.tex
Tables/TableD3.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2286045   .0929941    -2.46   0.015    -.4119574   -.0452516
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2482607   .0937419    -2.65   0.009    -.4330879   -.0634336
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0062876   .0898416    -0.07   0.944    -.1834247    .1708495
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2419731   .1090951    -2.22   0.028    -.4570716   -.0268746
------------------------------------------------------------------------------
Tables/TableD3.tex
Tables/TableD3.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.471471   .1346021    -3.50   0.001    -.7368608   -.2060813
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2020683   .0981058    -2.06   0.041    -.3954998   -.0086369
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.124116   .1138974    -1.09   0.277    -.3486831    .1004511
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0779523   .1522005    -0.51   0.609      -.37804    .2221354
------------------------------------------------------------------------------
Tables/TableD3.tex
Tables/TableD3.xml
dir : seeout

. 
. capture log close _all
