----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  TableD5
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-Effort_Luck\STATA\Paper-Final\Logs/TableD5.log
  log type:  text
 opened on:   6 Jul 2021, 09:31:47

. use "Data/Exp1-cleaned-long-state.dta", clear

. 
. * Pooled
. qui reg LogitPosterior LogitUnconditional LogitStateGood LogitStateBad, nocon vce(cluster ID)

. 
. lincom LogitUnconditional-1

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2988586   .0389547    -7.67   0.000     -.375551   -.2221663
------------------------------------------------------------------------------

. local est1 = r(estimate)

. local tstat1 = r(estimate)/r(se)

. local pval1 = tprob(r(df), abs(`tstat1'))

. 
. lincom LogitStateGood-1

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4697101   .0640813    -7.33   0.000    -.5958706   -.3435496
------------------------------------------------------------------------------

. local est2 = r(estimate)

. local tstat2 = r(estimate)/r(se)

. local pval2 = tprob(r(df), abs(`tstat2'))

. 
. lincom LogitStateBad-1

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1515125   .0677912    -2.23   0.026    -.2849769   -.0180482
------------------------------------------------------------------------------

. local est3 = r(estimate)

. local tstat3 = r(estimate)/r(se)

. local pval3 = tprob(r(df), abs(`tstat3'))

. 
. lincom LogitStateGood-LogitStateBad

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3181975   .0988747    -3.22   0.001    -.5128578   -.1235373
------------------------------------------------------------------------------

. local est4 = r(estimate)

. local tstat4 = r(estimate)/r(se)

. local pval4 = tprob(r(df), abs(`tstat4'))

. 
. outreg2 using "Tables/TableD5", label ctitle("Dependent variable: Logit(posterior)", "Pooled") ///
>         adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) replace tex excel noas
Tables/TableD5.tex
Tables/TableD5.xml
dir : seeout

. 
. * Separate by treatments
. foreach x of varlist RA LA HA GA {
  2. qui reg LogitPosterior LogitUnconditional LogitStateGood LogitStateBad if `x'==1, nocon vce(cluster ID)
  3. 
. lincom LogitUnconditional-1
  4. local est1 = r(estimate)
  5. local tstat1 = r(estimate)/r(se)
  6. local pval1 = tprob(r(df), abs(`tstat1'))
  7. 
. lincom LogitStateGood-1
  8. local est2 = r(estimate)
  9. local tstat2 = r(estimate)/r(se)
 10. local pval2 = tprob(r(df), abs(`tstat2'))
 11. 
. lincom LogitStateBad-1
 12. local est3 = r(estimate)
 13. local tstat3 = r(estimate)/r(se)
 14. local pval3 = tprob(r(df), abs(`tstat3'))
 15. 
. lincom LogitStateGood-LogitStateBad
 16. local est4 = r(estimate)
 17. local tstat4 = r(estimate)/r(se)
 18. local pval4 = tprob(r(df), abs(`tstat4'))
 19. 
. outreg2 using "Tables/TableD5", label ctitle("Dependent variable: Logit(posterior)", "`x'") ///
>         adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) append tex excel noas
 20. 
. }

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2634258   .0676923    -3.89   0.000    -.3966954   -.1301561
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4519756   .0858064    -5.27   0.000    -.6209075   -.2830436
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1702587   .0886962    -1.92   0.056      -.34488    .0043626
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2817168    .132123    -2.13   0.034    -.5418348   -.0215989
------------------------------------------------------------------------------
Tables/TableD5.tex
Tables/TableD5.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2909887   .0467213    -6.23   0.000    -.3829716   -.1990058
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.6420544   .0944892    -6.80   0.000    -.8280806   -.4560282
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0967808   .1099044    -0.88   0.379    -.3131557    .1195942
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.5452736   .1615024    -3.38   0.001    -.8632326   -.2273147
------------------------------------------------------------------------------
Tables/TableD5.tex
Tables/TableD5.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2844259   .0596614    -4.77   0.000    -.4018846   -.1669672
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3820773   .0828213    -4.61   0.000    -.5451322   -.2190224
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1334572   .0777736    -1.72   0.087    -.2865746    .0196601
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -.24862   .1207048    -2.06   0.040    -.4862585   -.0109816
------------------------------------------------------------------------------
Tables/TableD5.tex
Tables/TableD5.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.460599   .1056533    -4.36   0.000    -.6686046   -.2525935
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3384785   .0931812    -3.63   0.000    -.5219296   -.1550273
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2578836    .100014    -2.58   0.010    -.4547867   -.0609805
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0805949   .1466177    -0.55   0.583    -.3692495    .2080597
------------------------------------------------------------------------------
Tables/TableD5.tex
Tables/TableD5.xml
dir : seeout

. 
. capture log close _all
