----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  TableD9
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-Effort_Luck\STATA\Paper-Final\Logs/TableD9.log
  log type:  text
 opened on:   6 Jul 2021, 09:32:20

. use "Data/Exp2-cleaned.dta", clear

. 
. append using "Data/Exp1-cleaned.dta"

. replace treatment=3 if treatment==.
(272 real changes made)

. label define treatment_lbl 1 "Exp 2: Treatment S", replace

. label define treatment_lbl 2 "Exp 2: Treatment D", add

. label define treatment_lbl 3 "Exp 1", add

. label values treatment treatment_lbl

. gen lab=1 if treatment==3
(503 missing values generated)

. replace lab=0 if treatment!=3
(503 real changes made)

. 
. replace age=surveyAge if lab
(272 real changes made)

. replace female=surveyFemale if lab
(272 real changes made)

. replace economics=surveyEconomics if lab
(272 real changes made)

. replace undergraduate=surveyUG if lab
(272 real changes made)

. replace postgraduate=surveyPG if lab
(272 real changes made)

. replace australian=surveyAustralian if lab
(272 real changes made)

. replace australian=0 if lab & surveyAustralian!=1
(8 real changes made)

. replace past_experiments=surveyPastExp if lab
(272 real changes made)

. replace dg_gave_perc=DGGivePerc if lab
(272 real changes made)

. replace risk_invest_perc=RGInvestPerc if lab
(272 real changes made)

. 
. estpost tabstat age female economics postgraduate australian past_experiments dg_gave_perc risk_invest_perc, ///
>         statistics(mean count sd semean) columns(statistics) by(treatment)

Summary statistics: mean count sd semean
     for variables: age female economics postgraduate australian past_experiments dg_gave_perc risk_invest_perc
  by categories of: treatment

   treatment |   e(mean)   e(count)      e(sd)  e(semean) 
-------------+--------------------------------------------
1            |                                            
         age |  24.96296        297   4.735073   .2747568 
      female |  .5959596        297   .5117377    .029694 
   economics |  .0639731        297    .245118   .0142232 
postgraduate |  .5723906        297   .4955668   .0287557 
  australian |  .2255892        297   .4186752    .024294 
past_exper~s |  2.754209        297    2.38028   .1381179 
dg_gave_perc |  29.90572        297   21.73935   1.261445 
risk_inves~c |  71.10438        297   27.17547    1.57688 
-------------+--------------------------------------------
2            |                                            
         age |  25.38835        206    6.09155   .4244184 
      female |   .592233        206   .5024213   .0350054 
   economics |  .0776699        206   .2683034   .0186936 
postgraduate |  .5145631        206   .5010054   .0349067 
  australian |  .2475728        206   .4326537   .0301444 
past_exper~s |  2.873786        206    3.45756   .2408997 
dg_gave_perc |  30.78479        206   23.56946   1.642162 
risk_inves~c |  70.67961        206   25.41373   1.770659 
-------------+--------------------------------------------
3            |                                            
         age |  21.47794        272   5.842922   .3542792 
      female |  .5367647        272   .5212544   .0316057 
   economics |  .1397059        272   .3473207   .0210594 
postgraduate |  .2463235        272   .4316634   .0261734 
  australian |  .9705882        272   .1692692   .0102635 
past_exper~s |  .9080882        272   1.757118   .1065409 
dg_gave_perc |  32.80882        272    21.1168   1.280394 
risk_inves~c |  72.10294        272   28.22035    1.71111 
-------------+--------------------------------------------
Total        |                                            
         age |   23.8529        775   5.782584   .2077166 
      female |  .5741935        775   .5127368   .0184181 
   economics |  .0941935        775   .2922864   .0104992 
postgraduate |  .4425806        775   .4970128   .0178532 
  australian |  .4929032        775   .5002725   .0179703 
past_exper~s |  2.138065        775   2.689876   .0966232 
dg_gave_perc |  31.15828        775   22.03622   .7915645 
risk_inves~c |  71.34194        775   27.06783    .972305 

category labels saved in macro e(labels)

. esttab using "Tables/TableD9", main(mean %8.3f) aux(sd %8.3f) obslast label lines nostar unstack nonote nomtitle nonumber rtf ///
>         title("Subjects' characteristics in Experiment 1 and Experiment 2") brackets replace
(output written to Tables/TableD9.rtf)

. esttab using "Tables/TableD9", main(mean %8.3f) aux(sd %8.3f) obslast label lines nostar unstack nonote nomtitle nonumber tex ///
>         title("Subjects' characteristics in Experiment 1 and Experiment 2") brackets replace
(output written to Tables/TableD9.tex)

. 
. mvreg age female economics postgraduate australian past_experiments dg_gave_perc risk_invest_perc = i.lab

Equation             Obs   Parms        RMSE    "R-sq"          F        P
--------------------------------------------------------------------------
age                  775       2    5.515755    0.0913   77.69733   0.0000
female               775       2    .5123277    0.0029   2.236762   0.1352
economics            775       2    .2905493    0.0131   10.28303   0.0014
postgraduate         775       2    .4758773    0.0844    71.2793   0.0000
australian           775       2    .3562105    0.4937   753.6548   0.0000
past_exper~s         775       2     2.53468    0.1132   98.68471   0.0000
dg_gave_perc         775       2    22.01695    0.0030   2.355279   0.1253
risk_inves~c         775       2    27.07953    0.0004   .3309757   0.5653

----------------------------------------------------------------------------------
                 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
age              |
           1.lab |  -3.659236   .4151331    -8.81   0.000    -4.474158   -2.844314
           _cons |   25.13718   .2459353   102.21   0.000      24.6544    25.61996
-----------------+----------------------------------------------------------------
female           |
           1.lab |  -.0576687   .0385594    -1.50   0.135    -.1333622    .0180249
           _cons |   .5944334   .0228436    26.02   0.000     .5495906    .6392762
-----------------+----------------------------------------------------------------
economics        |
           1.lab |   .0701234   .0218677     3.21   0.001     .0271964    .1130504
           _cons |   .0695825    .012955     5.37   0.000     .0441514    .0950136
-----------------+----------------------------------------------------------------
postgraduate     |
           1.lab |  -.3023842    .035816    -8.44   0.000    -.3726924    -.232076
           _cons |   .5487078   .0212183    25.86   0.000     .5070554    .5903601
-----------------+----------------------------------------------------------------
australian       |
           1.lab |   .7359958   .0268095    27.45   0.000     .6833677    .7886239
           _cons |   .2345924   .0158826    14.77   0.000     .2034142    .2657707
-----------------+----------------------------------------------------------------
past_experiments |
           1.lab |  -1.895093    .190768    -9.93   0.000    -2.269577   -1.520608
           _cons |   2.803181   .1130158    24.80   0.000     2.581327    3.025035
-----------------+----------------------------------------------------------------
dg_gave_perc     |
           1.lab |   2.543085   1.657065     1.53   0.125    -.7097971    5.795966
           _cons |   30.26574   .9816875    30.83   0.000     28.33865    32.19283
-----------------+----------------------------------------------------------------
risk_invest_perc |
           1.lab |   1.172524   2.038091     0.58   0.565    -2.828325    5.173373
           _cons |   70.93042   1.207417    58.75   0.000     68.56021    73.30062
----------------------------------------------------------------------------------

. mvtest means age female economics postgraduate australian past_experiments dg_gave_perc risk_invest_perc, by(treatment)

Test for equality of 3 group means, assuming homogeneity

                            | Statistic   F(df1,     df2)   =  F      Prob>F
     -----------------------+-----------------------------------------------
              Wilks' lambda |    0.4584    16.0    1530.0     45.61   0.0000 e
             Pillai's trace |    0.5454    16.0    1532.0     35.90   0.0000 a
     Lawley-Hotelling trace |    1.1733    16.0    1528.0     56.03   0.0000 a
         Roy's largest root |    1.1662     8.0     766.0    111.67   0.0000 u
     -----------------------------------------------------------------------
                            e = exact, a = approximate, u = upper bound on F

. 
. mvreg age female economics postgraduate australian past_experiments dg_gave_perc risk_invest_perc = i.TreatS if lab!=1

Equation             Obs   Parms        RMSE    "R-sq"          F        P
--------------------------------------------------------------------------
age                  503       2    5.331997    0.0015   .7741827   0.3793
female               503       2    .5079463    0.0000    .006547   0.9355
economics            503       2    .2548601    0.0007   .3513117   0.5536
postgraduate         503       2    .4977994    0.0033   1.641403   0.2007
australian           503       2    .4244506    0.0007   .3262861   0.5681
past_exper~s         503       2    2.870379    0.0004   .2110947   0.6461
dg_gave_perc         503       2    22.50619    0.0004   .1855643   0.6668
risk_inves~c         503       2    26.46877    0.0001   .0313247   0.8596

----------------------------------------------------------------------------------
                 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
age              |
          TreatS |
              S  |  -.4253866   .4834617    -0.88   0.379    -1.375249    .5244755
           _cons |   25.38835   .3714978    68.34   0.000     24.65846    26.11824
-----------------+----------------------------------------------------------------
female           |
          TreatS |
              S  |   .0037266   .0460564     0.08   0.936    -.0867609    .0942141
           _cons |    .592233   .0353903    16.73   0.000     .5227013    .6617647
-----------------+----------------------------------------------------------------
economics        |
          TreatS |
              S  |  -.0136968   .0231086    -0.59   0.554    -.0590986    .0317049
           _cons |   .0776699   .0177569     4.37   0.000     .0427826    .1125572
-----------------+----------------------------------------------------------------
postgraduate     |
          TreatS |
              S  |   .0578275   .0451364     1.28   0.201    -.0308524    .1465073
           _cons |   .5145631   .0346833    14.84   0.000     .4464204    .5827058
-----------------+----------------------------------------------------------------
australian       |
          TreatS |
              S  |  -.0219836   .0384857    -0.57   0.568    -.0975968    .0536296
           _cons |   .2475728   .0295729     8.37   0.000     .1894707    .3056749
-----------------+----------------------------------------------------------------
past_experiments |
          TreatS |
              S  |  -.1195777   .2602623    -0.46   0.646    -.6309178    .3917625
           _cons |   2.873786   .1999888    14.37   0.000     2.480866    3.266706
-----------------+----------------------------------------------------------------
dg_gave_perc     |
          TreatS |
              S  |  -.8790658   2.040676    -0.43   0.667    -4.888404    3.130272
           _cons |   30.78479   1.568081    19.63   0.000     27.70397    33.86561
-----------------+----------------------------------------------------------------
risk_invest_perc |
          TreatS |
              S  |   .4247655   2.399971     0.18   0.860    -4.290482    5.140013
           _cons |   70.67961   1.844167    38.33   0.000     67.05636    74.30287
----------------------------------------------------------------------------------

. mvtest means age female economics postgraduate australian past_experiments dg_gave_perc risk_invest_perc if lab!=1, by(TreatS)

Test for equality of 2 group means, assuming homogeneity

                            | Statistic   F(df1,     df2)   =  F      Prob>F
     -----------------------+-----------------------------------------------
              Wilks' lambda |    0.9898     8.0     494.0      0.63   0.7498 e
             Pillai's trace |    0.0102     8.0     494.0      0.63   0.7498 e
     Lawley-Hotelling trace |    0.0103     8.0     494.0      0.63   0.7498 e
         Roy's largest root |    0.0103     8.0     494.0      0.63   0.7498 e
     -----------------------------------------------------------------------
                            e = exact, a = approximate, u = upper bound on F

. 
. capture log close _all
