----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  TableD12
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-Effort_Luck\STATA\Paper-Final\Logs/TableD12.log
  log type:  text
 opened on:   6 Jul 2021, 09:32:27

. use "Data/Exp2-cleaned-long-state.dta", clear

. keep if consistent
(522 observations deleted)

. 
. * Treatment S, Treatment D
. local replace replace

. foreach x in S D {
  2.     reg logit_posterior logit_prior logit_prob_success logit_prob_failure if Treat`x'==1, nocon vce(cluster id)
  3.         
.         lincom logit_prior-1
  4.         local est1 = r(estimate)
  5.         local tstat1 = r(estimate)/r(se)
  6.         local pval1 = tprob(r(df), abs(`tstat1'))
  7. 
.         lincom logit_prob_success-1
  8.         local est2 = r(estimate)
  9.         local tstat2 = r(estimate)/r(se)
 10.         local pval2 = tprob(r(df), abs(`tstat2'))
 11. 
.         lincom logit_prob_failure-1
 12.         local est3 = r(estimate)
 13.         local tstat3 = r(estimate)/r(se)
 14.         local pval3 = tprob(r(df), abs(`tstat3'))
 15. 
.         lincom logit_prob_success-logit_prob_failure
 16.         local est4 = r(estimate)
 17.         local tstat4 = r(estimate)/r(se)
 18.         local pval4 = tprob(r(df), abs(`tstat4'))
 19. 
.         outreg2 using "Tables/TableD12", label ctitle("Dependent variable: Logit(posterior)", "Treatment `x'") ///
>                 adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) `replace' tex excel noas
 20. local replace append
 21. }

Linear regression                               Number of obs     =        888
                                                F(3, 147)         =      53.85
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3995
                                                Root MSE          =     2.7534

                                         (Std. Err. adjusted for 148 clusters in id)
------------------------------------------------------------------------------------
                   |               Robust
   logit_posterior |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
       logit_prior |   .5247267   .0633131     8.29   0.000     .3996052    .6498481
logit_prob_success |   .8033878   .1463876     5.49   0.000     .5140918    1.092684
logit_prob_failure |   .9902096   .1447426     6.84   0.000     .7041645    1.276255
------------------------------------------------------------------------------------

 ( 1)  logit_prior = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4752733   .0633131    -7.51   0.000    -.6003948   -.3501519
------------------------------------------------------------------------------

 ( 1)  logit_prob_success = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1966122   .1463876    -1.34   0.181    -.4859082    .0926837
------------------------------------------------------------------------------

 ( 1)  logit_prob_failure = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0097904   .1447426    -0.07   0.946    -.2958355    .2762547
------------------------------------------------------------------------------

 ( 1)  logit_prob_success - logit_prob_failure = 0

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1868218   .2101661    -0.89   0.375    -.6021591    .2285155
------------------------------------------------------------------------------
Tables/TableD12.tex
Tables/TableD12.xml
dir : seeout

Linear regression                               Number of obs     =      1,014
                                                F(3, 168)         =      76.40
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4000
                                                Root MSE          =     2.6757

                                         (Std. Err. adjusted for 169 clusters in id)
------------------------------------------------------------------------------------
                   |               Robust
   logit_posterior |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
       logit_prior |   .5457915    .063865     8.55   0.000     .4197103    .6718728
logit_prob_success |   .8452334   .1385714     6.10   0.000     .5716677    1.118799
logit_prob_failure |   1.107048   .1221705     9.06   0.000     .8658609    1.348235
------------------------------------------------------------------------------------

 ( 1)  logit_prior = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4542085    .063865    -7.11   0.000    -.5802897   -.3281272
------------------------------------------------------------------------------

 ( 1)  logit_prob_success = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1547666   .1385714    -1.12   0.266    -.4283323    .1187991
------------------------------------------------------------------------------

 ( 1)  logit_prob_failure = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .107048   .1221705     0.88   0.382    -.1341391    .3482352
------------------------------------------------------------------------------

 ( 1)  logit_prob_success - logit_prob_failure = 0

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2618147   .1955613    -1.34   0.182    -.6478888    .1242595
------------------------------------------------------------------------------
Tables/TableD12.tex
Tables/TableD12.xml
dir : seeout

. 
. * Treatment S + Treatment D
. reg logit_posterior logit_prior logit_prob_success logit_prob_failure, nocon vce(cluster id)

Linear regression                               Number of obs     =      1,902
                                                F(3, 316)         =     127.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3994
                                                Root MSE          =     2.7108

                                         (Std. Err. adjusted for 317 clusters in id)
------------------------------------------------------------------------------------
                   |               Robust
   logit_posterior |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
       logit_prior |   .5345744   .0448894    11.91   0.000     .4462545    .6228944
logit_prob_success |    .826655   .1004961     8.23   0.000      .628929    1.024381
logit_prob_failure |    1.05154   .0936882    11.22   0.000      .867209    1.235872
------------------------------------------------------------------------------------

. 
. lincom logit_prior-1

 ( 1)  logit_prior = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.4654256   .0448894   -10.37   0.000    -.5537455   -.3771056
------------------------------------------------------------------------------

. local est1 = r(estimate)

. local tstat1 = r(estimate)/r(se)

. local pval1 = tprob(r(df), abs(`tstat1'))

. 
. lincom logit_prob_success-1

 ( 1)  logit_prob_success = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.173345   .1004961    -1.72   0.086     -.371071     .024381
------------------------------------------------------------------------------

. local est2 = r(estimate)

. local tstat2 = r(estimate)/r(se)

. local pval2 = tprob(r(df), abs(`tstat2'))

. 
. lincom logit_prob_failure-1

 ( 1)  logit_prob_failure = 1

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0515405   .0936882     0.55   0.583     -.132791    .2358719
------------------------------------------------------------------------------

. local est3 = r(estimate)

. local tstat3 = r(estimate)/r(se)

. local pval3 = tprob(r(df), abs(`tstat3'))

. 
. lincom logit_prob_success-logit_prob_failure

 ( 1)  logit_prob_success - logit_prob_failure = 0

------------------------------------------------------------------------------
logit_post~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2248855   .1429365    -1.57   0.117    -.5061129     .056342
------------------------------------------------------------------------------

. local est4 = r(estimate)

. local tstat4 = r(estimate)/r(se)

. local pval4 = tprob(r(df), abs(`tstat4'))

. 
. outreg2 using "Tables/TableD12", label ctitle("Dependent variable: Logit(posterior)", "S + D") ///
>         adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) append tex excel noas
Tables/TableD12.tex
Tables/TableD12.xml
dir : seeout

. 
. * Joint test of coefficients between columns (1) and (2)
. reg logit_posterior i.TreatD#c.logit_prior i.TreatD#c.logit_prob_success i.TreatD#c.logit_prob_failure, nocon vce(cluster id)

Linear regression                               Number of obs     =      1,902
                                                F(6, 316)         =      65.29
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3998
                                                Root MSE          =     2.7122

                                                  (Std. Err. adjusted for 317 clusters in id)
---------------------------------------------------------------------------------------------
                            |               Robust
            logit_posterior |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
       TreatD#c.logit_prior |
                         S  |   .5247267   .0632105     8.30   0.000     .4003601    .6490933
                         D  |   .5457915   .0637974     8.56   0.000     .4202702    .6713128
                            |
TreatD#c.logit_prob_success |
                         S  |   .8033878   .1461503     5.50   0.000     .5158371    1.090938
                         D  |   .8452334   .1384248     6.11   0.000     .5728827    1.117584
                            |
TreatD#c.logit_prob_failure |
                         S  |   .9902096    .144508     6.85   0.000     .7058901    1.274529
                         D  |   1.107048   .1220412     9.07   0.000      .866932    1.347164
---------------------------------------------------------------------------------------------

. testparm TreatD#c.logit_prior, equal

 ( 1)  - 0b.TreatD#c.logit_prior + 1.TreatD#c.logit_prior = 0

       F(  1,   316) =    0.06
            Prob > F =    0.8147

. testparm TreatD#c.logit_prob_success, equal

 ( 1)  - 0b.TreatD#c.logit_prob_success + 1.TreatD#c.logit_prob_success = 0

       F(  1,   316) =    0.04
            Prob > F =    0.8355

. testparm TreatD#c.logit_prob_failure, equal

 ( 1)  - 0b.TreatD#c.logit_prob_failure + 1.TreatD#c.logit_prob_failure = 0

       F(  1,   316) =    0.38
            Prob > F =    0.5372

. 
. * Joint test of coefficients between columns (3) and Exp 1
. use "Data/Exp2-cleaned-long-state.dta", clear

. append using "Data/Exp1-cleaned-long-state.dta"

. keep if consistent==1 | b_Group3==1
(1,920 observations deleted)

. 
. replace logit_prior=LogitUnconditional if b_Group==3
(2,460 real changes made)

. replace logit_posterior=LogitPosterior if b_Group==3
(2,460 real changes made)

. replace logit_prob_success=LogitStateGood if b_Group==3
(2,460 real changes made)

. replace logit_prob_failure=LogitStateBad if b_Group==3
(2,460 real changes made)

. 
. replace id=ID if b_Group3==1
(2,460 real changes made)

. 
. replace treatment=3 if treatment==.
(2,460 real changes made)

. gen lab=1 if treatment==3
(1,902 missing values generated)

. replace lab=0 if treatment!=3
(1,902 real changes made)

. 
. reg logit_posterior i.lab#c.logit_prior i.lab#c.logit_prob_success i.lab#c.logit_prob_failure, nocon vce(cluster id)

Linear regression                               Number of obs     =      4,362
                                                F(6, 377)         =     252.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4925
                                                Root MSE          =     2.2119

                                               (Std. Err. adjusted for 378 clusters in id)
------------------------------------------------------------------------------------------
                         |               Robust
         logit_posterior |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
       lab#c.logit_prior |
                      0  |   .5345744   .0448801    11.91   0.000     .4463278    .6228211
                      1  |   .6946426   .0391944    17.72   0.000     .6175757    .7717096
                         |
lab#c.logit_prob_success |
                      0  |    .826655   .1004752     8.23   0.000      .629093    1.024217
                      1  |   .7505328   .0514342    14.59   0.000      .649399    .8516667
                         |
lab#c.logit_prob_failure |
                      0  |    1.05154   .0936687    11.23   0.000     .8673619    1.235719
                      1  |     .96574   .0665395    14.51   0.000      .834905    1.096575
------------------------------------------------------------------------------------------

. testparm lab#c.logit_prior, equal

 ( 1)  - 0b.lab#c.logit_prior + 1.lab#c.logit_prior = 0

       F(  1,   377) =    7.02
            Prob > F =    0.0084

. testparm lab#c.logit_prob_success, equal

 ( 1)  - 0b.lab#c.logit_prob_success + 1.lab#c.logit_prob_success = 0

       F(  1,   377) =    0.47
            Prob > F =    0.4926

. testparm lab#c.logit_prob_failure, equal

 ( 1)  - 0b.lab#c.logit_prob_failure + 1.lab#c.logit_prob_failure = 0

       F(  1,   377) =    0.51
            Prob > F =    0.4750

. 
. capture log close _all
