----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  Table5
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-Effort_Luck\STATA\Paper-Final\Logs/Table5.log
  log type:  text
 opened on:   5 Jul 2021, 17:00:16

. use "Data/Exp1-cleaned-long-state.dta", clear

. keep if b_Group3==1
(804 observations deleted)

. 
. local replace replace

. foreach x of numlist 0/1{
  2. qui reg LogitPosterior LogitUnconditional LogitStateGood LogitStateBad if LGHighEff==`x', nocon vce(cluster ID)
  3. 
. lincom LogitUnconditional-1
  4. local est1 = r(estimate)
  5. local tstat1 = r(estimate)/r(se)
  6. local pval1 = tprob(r(df), abs(`tstat1'))
  7. 
. lincom LogitStateGood-1
  8. local est2 = r(estimate)
  9. local tstat2 = r(estimate)/r(se)
 10. local pval2 = tprob(r(df), abs(`tstat2'))
 11. 
. lincom LogitStateBad-1
 12. local est3 = r(estimate)
 13. local tstat3 = r(estimate)/r(se)
 14. local pval3 = tprob(r(df), abs(`tstat3'))
 15. 
. lincom LogitStateGood-LogitStateBad
 16. local est4 = r(estimate)
 17. local tstat4 = r(estimate)/r(se)
 18. local pval4 = tprob(r(df), abs(`tstat4'))
 19. 
. outreg2 using "Tables/Table5", label ctitle("Dependent variable: Logit(posterior)", "Choose high effort = `x'") ///
>         adds(delta,`est1',t-stat_delta,`tstat1',p-val_delta,`pval1', ///
>         gammaG,`est2',t-stat_gammaG,`tstat2',p-val_gammaG,`pval2', ///
>         gammaB,`est3',t-stat_gammaB,`tstat3',p-val_gammaB,`pval3', ///
>         gammaG=gammaB,`est4',t-stat_gammaG=gammaB,`tstat4',p-val_gammaG=gammaB,`pval4') bdec(3) sdec(3) `replace' tex excel noas
 20. local replace append
 21. }

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2899055   .0476075    -6.09   0.000    -.3838158   -.1959953
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.301895   .0589426    -5.12   0.000    -.4181649   -.1856251
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0765481   .0798787    -0.96   0.339    -.2341163    .0810201
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2253469     .08774    -2.57   0.011    -.3984225   -.0522713
------------------------------------------------------------------------------
Tables/Table5.tex
Tables/Table5.xml
dir : seeout

 ( 1)  LogitUnconditional = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3967447   .0728847    -5.44   0.000     -.541004   -.2524855
------------------------------------------------------------------------------

 ( 1)  LogitStateGood = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0429981   .1102621    -0.39   0.697    -.2612377    .1752415
------------------------------------------------------------------------------

 ( 1)  LogitStateBad = 1

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0492029   .0995992    -0.49   0.622    -.2463375    .1479318
------------------------------------------------------------------------------

 ( 1)  LogitStateGood - LogitStateBad = 0

------------------------------------------------------------------------------
LogitPoste~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0062048    .128038     0.05   0.961    -.2472184    .2596279
------------------------------------------------------------------------------
Tables/Table5.tex
Tables/Table5.xml
dir : seeout

. 
. reg LogitPosterior i.LGHighEff#c.LogitUnconditional i.LGHighEff#c.LogitStateGood i.LGHighEff#c.LogitStateBad, nocon vce(cluster ID)

Linear regression                               Number of obs     =      2,460
                                                F(6, 204)         =     226.51
                                                Prob > F          =     0.0000
                                                R-squared         =     0.6101
                                                Root MSE          =     1.7263

                                                     (Std. Err. adjusted for 205 clusters in ID)
------------------------------------------------------------------------------------------------
                               |               Robust
                LogitPosterior |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
LGHighEff#c.LogitUnconditional |
                            0  |   .7100945   .0476177    14.91   0.000     .6162084    .8039805
                            1  |   .6032553   .0727547     8.29   0.000     .4598076    .7467029
                               |
    LGHighEff#c.LogitStateGood |
                            0  |    .698105   .0589553    11.84   0.000     .5818651    .8143449
                            1  |   .9570019   .1100655     8.69   0.000     .7399902    1.174014
                               |
     LGHighEff#c.LogitStateBad |
                            0  |   .9234519   .0798959    11.56   0.000     .7659243     1.08098
                            1  |   .9507971   .0994216     9.56   0.000     .7547715    1.146823
------------------------------------------------------------------------------------------------

. testparm LGHighEff#c.LogitUnconditional, equal

 ( 1)  - 0b.LGHighEff#c.LogitUnconditional + 1.LGHighEff#c.LogitUnconditional = 0

       F(  1,   204) =    1.50
            Prob > F =    0.2219

. testparm LGHighEff#c.LogitStateGood, equal

 ( 1)  - 0b.LGHighEff#c.LogitStateGood + 1.LGHighEff#c.LogitStateGood = 0

       F(  1,   204) =    4.53
            Prob > F =    0.0346

. testparm LGHighEff#c.LogitStateBad, equal

 ( 1)  - 0b.LGHighEff#c.LogitStateBad + 1.LGHighEff#c.LogitStateBad = 0

       F(  1,   204) =    0.05
            Prob > F =    0.8181

. 
. capture log close _all
